Revit 2023 API
EnergyAnalysisSpace.ComposedName Property
 The composed name for this space.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public string ComposedName { get; }
Visual Basic
Public ReadOnly Property ComposedName As String
	Get
Visual C++
public:
property String^ ComposedName {
	String^ get ();
}
Remarks
 This value is composed of the name and description attributes, separated by a space.
See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace